{
	"productName": "Flow Like",
	"version": "0.0.0",
	"identifier": "de.good-co.btns",
	"build": {
		"beforeDevCommand": "bun run dev",
		"devUrl": "http://localhost:3000",
		"beforeBuildCommand": "bun run build",
		"frontendDist": "../out"
	},
	"app": {
		"macOSPrivateApi": true,
		"windows": [
			{
				"fullscreen": false,
				"resizable": true,
				"title": "Flow Like",
				"width": 1920,
				"height": 1080,
				"transparent": false,
				"skipTaskbar": false,
				"decorations": true,
				"maximized": false
			}
		],
		"security": {
			"csp": null,
			"assetProtocol": {
				"enable": true,
				"scope": ["**/*"]
			}
		}
	},
	"bundle": {
		"fileAssociations": [
			{
				"ext": ["fl-app"],
				"description": "Flow-Like App",
				"mimeType": "application/vnd.flow-like.app",
				"name": "Flow-Like App",
				"role": "Editor"
			},
			{
				"ext": ["fl-flow"],
				"description": "Flow-Like Flow",
				"mimeType": "application/vnd.flow-like.flow",
				"name": "Flow-Like Flow",
				"role": "Editor"
			}
		],
		"category": "Utility",
		"windows": {
			"webviewInstallMode": {
				"type": "offlineInstaller"
			}
		},
		"shortDescription": "Flow-Like is a revolutionary all-in-one platform that democratizes app development. Build custom apps with ease, leverage powerful data tools, and create cutting-edge GenAI solutions – all without coding. Then share or embed your creations anywhere. It's like an app store, IDE, and AI playground combined.",
		"longDescription": "Flow-Like represents a paradigm shift in software development, merging the accessibility of a no-code platform with the power of an advanced IDE and the versatility of an app store. This innovative tool empowers anyone, regardless of their technical expertise, to build custom applications, manage and prepare data, and even develop sophisticated GenAI tools.\n\nImagine a platform where creating an app is as simple as dragging and dropping pre-built \"flow-like\" (components). flow-like eliminates the need for traditional coding, opening the doors to rapid prototyping and development for individuals, teams, and entire organizations. Whether you need a simple data visualization tool, a complex workflow automation system, or a powerful AI assistant, flow-like provides the building blocks to make it happen.\n\nBut flow-like isn't just about creation. It's about sharing and collaboration. The integrated app store functionality allows users to publish their creations, making them available to colleagues or a wider audience. This fosters a collaborative ecosystem where users can benefit from each other's innovations, accelerating progress and problem-solving across the board. Furthermore, the apps built on flow-like are designed to be embeddable, meaning they can seamlessly integrate into any existing software, adding custom functionality without disrupting established workflows.\n\nIn essence, flow-like is more than just software; it's a movement towards democratizing development, empowering users to turn their ideas into reality, and ushering in a new era of accessible, collaborative, and AI-powered applications. With the ability to create data tools, GenAI solutions, and so much more all within a simple no-code interface, flow-like is poised to transform the way we interact with technology and solve problems in the modern world.",
		"macOS": {
			"exceptionDomain": "localhost"
		},
		"homepage": "https://flow-like.com",
		"publisher": "TM9657 GmbH",
		"licenseFile": "../LICENSE",
		"active": true,
		"targets": "all",
		"icon": [
			"icons/32x32.png",
			"icons/128x128.png",
			"icons/128x128@2x.png",
			"icons/icon.icns",
			"icons/icon.ico"
		],
		"externalBin": ["bin/llamafiler", "bin/pandoc"],
		"resources": ["assets/licenses.md"]
	},
	"plugins": {
		"deep-link": {
			"mobile": [{ "host": "mobile.flow-like.com", "pathPrefix": ["/"] }],
			"desktop": {
				"schemes": ["flow-like-app", "fl-app"]
			}
		}
	}
}
